const Mock = require('mockjs')

Mock.mock(/\/moment/, 'get', {
  ok: 1,
  size: 10,
  page: 1,
  data: [
    {
      _id: '@id',
      createdTime: 1571299457065,
      modifiedTime: 1571299777065,
      type: 'moment',
      content: {
        title: '标题',
        body:
          '这是现实大学生的真实写照。很多大学生，上了大学便开始放飞自我了，我相信也有很大一部分原因是高中老师告诉他们，你们上了大学就可以玩了，也对，我也是其中的一个受骗者。其实这句话也不完全错误。的确上了大学，没有人再来管你的学习了，除非你在第一学期挂了很多门课，当然老师都是很水的，真要想挂科还是挺难的。于是到了第二学期更加不思进取，感觉反正第一学期啥也没学期末也没挂科，无所谓了，到了最后可能连最水的考试你都要过不去了。于是开始了重修。这是一条不归路。\n当你真的想去后悔，想改过自新时，真的太难了。第一是，欠下的太多，不知道从何补起；第二是惰性，对游戏的牵挂。最后想想，还是算了，反正都这样了，我反正没希望了。相反，在游戏上，却不忍于落后，花费更多时间和精力去提升自己。这是现实大学生的真实写照。很多大学生，上了大学便开始放飞自我了，我相信也有很大一部分原因是高中老师告诉他们，你们上了大学就可以玩了，也对，我也是其中的一个受骗者。其实这句话也不完全错误。的确上了大学，没有人再来管你的学习了，除非你在第一学期挂了很多门课，当然老师都是很水的，真要想挂科还是挺难的。于是到了第二学期更加不思进取，感觉反正第一学期啥也没学期末也没挂科，无所谓了，到了最后可能连最水的考试你都要过不去了。于是开始了重修。这是一条不归路。\n当你真的想去后悔，想改过自新时，真的太难了。第一是，欠下的太多，不知道从何补起；第二是惰性，对游戏的牵挂。最后想想，还是算了，反正都这样了，我反正没希望了。相反，在游戏上，却不忍于落后，花费更多时间和精力去提升自己。这是现实大学生的真实写照。很多大学生，上了大学便开始放飞自我了，我相信也有很大一部分原因是高中老师告诉他们，你们上了大学就可以玩了，也对，我也是其中的一个受骗者。其实这句话也不完全错误。的确上了大学，没有人再来管你的学习了，除非你在第一学期挂了很多门课，当然老师都是很水的，真要想挂科还是挺难的。于是到了第二学期更加不思进取，感觉反正第一学期啥也没学期末也没挂科，无所谓了，到了最后可能连最水的考试你都要过不去了。于是开始了重修。这是一条不归路。\n当你真的想去后悔，想改过自新时，真的太难了。第一是，欠下的太多，不知道从何补起；第二是惰性，对游戏的牵挂。最后想想，还是算了，反正都这样了，我反正没希望了。相反，在游戏上，却不忍于落后，花费更多时间和精力去提升自己。这是现实大学生的真实写照。很多大学生，上了大学便开始放飞自我了，我相信也有很大一部分原因是高中老师告诉他们，你们上了大学就可以玩了，也对，我也是其中的一个受骗者。其实这句话也不完全错误。的确上了大学，没有人再来管你的学习了，除非你在第一学期挂了很多门课，当然老师都是很水的，真要想挂科还是挺难的。于是到了第二学期更加不思进取，感觉反正第一学期啥也没学期末也没挂科，无所谓了，到了最后可能连最水的考试你都要过不去了。于是开始了重修。这是一条不归路。\n当你真的想去后悔，想改过自新时，真的太难了。第一是，欠下的太多，不知道从何补起；第二是惰性，对游戏的牵挂。最后想想，还是算了，反正都这样了，我反正没希望了。相反，在游戏上，却不忍于落后，花费更多时间和精力去提升自己。这是现实大学生的真实写照。很多大学生，上了大学便开始放飞自我了，我相信也有很大一部分原因是高中老师告诉他们，你们上了大学就可以玩了，也对，我也是其中的一个受骗者。其实这句话也不完全错误。的确上了大学，没有人再来管你的学习了，除非你在第一学期挂了很多门课，当然老师都是很水的，真要想挂科还是挺难的。于是到了第二学期更加不思进取，感觉反正第一学期啥也没学期末也没挂科，无所谓了，到了最后可能连最水的考试你都要过不去了。于是开始了重修。这是一条不归路。\n当你真的想去后悔，想改过自新时，真的太难了。第一是，欠下的太多，不知道从何补起；第二是惰性，对游戏的牵挂。最后想想，还是算了，反正都这样了，我反正没希望了。相反，在游戏上，却不忍于落后，花费更多时间和精力去提升自己。这是现实大学生的真实写照。很多大学生，上了大学便开始放飞自我了，我相信也有很大一部分原因是高中老师告诉他们，你们上了大学就可以玩了，也对，我也是其中的一个受骗者。其实这句话也不完全错误。的确上了大学，没有人再来管你的学习了，除非你在第一学期挂了很多门课，当然老师都是很水的，真要想挂科还是挺难的。于是到了第二学期更加不思进取，感觉反正第一学期啥也没学期末也没挂科，无所谓了，到了最后可能连最水的考试你都要过不去了。于是开始了重修。这是一条不归路。\n当你真的想去后悔，想改过自新时，真的太难了。第一是，欠下的太多，不知道从何补起；第二是惰性，对游戏的牵挂。最后想想，还是算了，反正都这样了，我反正没希望了。相反，在游戏上，却不忍于落后，花费更多时间和精力去提升自己。',
        mood: '开心',
        weather: 'Sunny'
      }
    },
    {
      _id: '@id',
      createdTime: 1571299457065,
      modifiedTime: 1571299457065,
      type: 'hitokoto',
      content: {
        source: 'yiny',
        body: '今天的天气真好'
      }
    },
    {
      _id: '@id',
      createdTime: 1571299457065,
      modifiedTime: 1571299777065,
      type: 'idea',
      content: {
        body: '今天的天气真好'
      }
    },
    {
      _id: '@id',
      createdTime: 1571299457065,
      modifiedTime: 1571299777065,
      type: 'picture',
      content: {
        src: 'https://i.loli.net/2019/08/18/vGNB4oOepVA6lPQ.jpg',
        comment: '日本'
      }
    },
    {
      _id: '@id',
      createdTime: 1571199457065,
      modifiedTime: 1571299777065,
      type: 'moment',
      content: {
        title: '这是一条瞬间',
        body: '今天的天气真好',
        mood: '开心'
      }
    },
    {
      _id: '@id',
      createdTime: 1571099457065,
      modifiedTime: 1571399777065,
      type: 'hitokoto',
      content: {
        source: 'yiny',
        body: '今天的天气真好'
      }
    },
    {
      _id: '@id',
      createdTime: 1570999457065,
      modifiedTime: 1571299777065,
      type: 'idea',
      content: {
        body: '今天的天气真好'
      }
    },
    {
      _id: '@id',
      createdTime: 1570899457065,
      modifiedTime: 1571299777065,
      type: 'picture',
      content: {
        src: 'https://i.loli.net/2019/08/18/vGNB4oOepVA6lPQ.jpg',
        comment: '日本'
      }
    },
    {
      _id: '@id',
      createdTime: 1570699457065,
      modifiedTime: 1571299777065,
      type: 'idea',
      content: {
        body: '今天的天气真好'
      }
    },
    {
      _id: '@id',
      createdTime: 1570499457065,
      modifiedTime: 1571299777065,
      type: 'picture',
      content: {
        src: 'https://i.loli.net/2019/08/18/vGNB4oOepVA6lPQ.jpg',
        comment: '好漂亮啊！！！！'
      }
    }
  ]
})
